In [33]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [18]:
data = {
    "jobs: ": ["Data_Scientist", "Data_Engineer", "Data_Analyst"],
    "Nova_Jersey": [97350, 82080, 112840],
    "Florida": [77140, 71540, 62310],
}

dataset = pd.DataFrame(data)

dataset.head()

           jobs:   Nova_Jersey  Florida
0  Data_Scientist        97350    77140
1   Data_Engineer        82080    71540
2    Data_Analyst       112840    62310

In [19]:
print(dataset["Nova_Jersey"].sum(), dataset["Florida"].sum())

292270 210990

In [20]:
dataset["%_Nova_Jersey"] = round(
    dataset["Nova_Jersey"] / dataset["Nova_Jersey"].sum() * 100, 2
)

dataset["%_Florida"] = round(dataset["Florida"] / dataset["Florida"].sum() * 100, 2)

dataset.head()

           jobs:   Nova_Jersey  Florida  %_Nova_Jersey  %_Florida
0  Data_Scientist        97350    77140          33.31      36.56
1   Data_Engineer        82080    71540          28.08      33.91
2    Data_Analyst       112840    62310          38.61      29.53

# Exercise

In [21]:
dataset_census = pd.read_csv("data/census.csv")

dataset_census.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [22]:
dataset_census = dataset_census[["education", "income"]]

dataset_census.shape

(32561, 2)

In [23]:
dataset_census.head()

    education  income
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [24]:
dataset_census = dataset_census.groupby(["education", "income"])["education"].count()

dataset_census = dataset_census.sort_values(ascending=False)

dataset_census

education     income
HS-grad       <=50K     8826
Some-college  <=50K     5904
Bachelors     <=50K     3134
              >50K      2221
HS-grad       >50K      1675
Some-college  >50K      1387
11th          <=50K     1115
Assoc-voc     <=50K     1021
Masters       >50K       959
10th          <=50K      871
Assoc-acdm    <=50K      802
Masters       <=50K      764
7th-8th       <=50K      606
9th           <=50K      487
Prof-school   >50K       423
12th          <=50K      400
Assoc-voc     >50K       361
5th-6th       <=50K      317
Doctorate     >50K       306
Assoc-acdm    >50K       265
1st-4th       <=50K      162
Prof-school   <=50K      153
Doctorate     <=50K      107
10th          >50K        62
11th          >50K        60
Preschool     <=50K       51
7th-8th       >50K        40
12th          >50K        33
9th           >50K        27
5th-6th       >50K        16
1st-4th       >50K         6
Name: education, dtype: int64

In [25]:
dataset_census.index

MultiIndex([(     ' HS-grad', ' <=50K'),
            (' Some-college', ' <=50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (     ' HS-grad',  ' >50K'),
            (' Some-college',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (   ' Assoc-voc', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (        ' 10th', ' <=50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (     ' Masters', ' <=50K'),
            (     ' 7th-8th', ' <=50K'),
            (         ' 9th', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            (   ' Doctorate', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (        ' 12th',  ' >50K'),
            (         ' 9th',  ' >50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 1st-4th',  ' >50K')],
           names=['education', 'income'])

In [26]:
dataset_census[" Bachelors", " <=50K"], dataset_census[" Bachelors", " >50K"]

(3134, 2221)

In [27]:
round(
    (
        dataset_census[" Bachelors", " >50K"]
        / (
            dataset_census[" Bachelors", " <=50K"]
            + dataset_census[" Bachelors", " >50K"]
        )
    )
    * 100,
    2,
)

41.48

In [28]:
round(
    (
        dataset_census[" Bachelors", " <=50K"]
        / (
            dataset_census[" Bachelors", " <=50K"]
            + dataset_census[" Bachelors", " >50K"]
        )
    )
    * 100,
    2,
)

58.52

### Exercise:

In [30]:
data = {
    "year": ["1", "2", "3", "4", "total"],
    "mar_grade": [70, 50, 47, 23, 190],
    "nov_grade": [65, 48, 40, 22, 175],
}

dataset = pd.DataFrame(data)

dataset.head()

    year  mar_grade  nov_grade
0      1         70         65
1      2         50         48
2      3         47         40
3      4         23         22
4  total        190        175

In [ ]:
dataset["evasion"] = round(
    (dataset["mar_grade"] - dataset["nov_grade"]) / dataset["mar_grade"] * 100, 2
)

dataset.head()

    year  mar_grade  nov_grade  evasion
0      1         70         65     7.14
1      2         50         48     4.00
2      3         47         40    14.89
3      4         23         22     4.35
4  total        190        175     7.89